<?php
/**
 * Created by PhpStorm.
 * User: kurisu
 * Date: 2017/11/04
 * Time: 3:36
 */


return [

    /*
    |--------------------------------------------------------------------------
    | plan
    |--------------------------------------------------------------------------
    |
    | 使用的方案名称
    */

    'plan' => 'ZhengFang' ,

    /*
    |--------------------------------------------------------------------------
    | serviceProvider
    |--------------------------------------------------------------------------
    |
    | 各个服务的提供者
    */

    'provider' => [
        'GetImageInfo' => 'GetImageInfoZhengFang' ,
        'Pretreatment' => 'PretreatmentZhengFang' ,
        'Cutting'      => 'CuttingZhengFang' ,
        'Identify'     => 'IdentifyZhengFang' ,
    ] ,

    /*
    |--------------------------------------------------------------------------
    | 字典的目录和使用的字典
    |--------------------------------------------------------------------------
    |
    */

    'dictionary' => 'dictionary/zhengFang_autoTest.json' ,

    /*
    |--------------------------------------------------------------------------
    | 获取验证码的模式
    |--------------------------------------------------------------------------
    |
    | local , online
    */

    'verifyImageMode' => 'local' ,
//    'VerifyImageMode' => 'online' ,

    /*
    |--------------------------------------------------------------------------
    | 获取验证码的目录和url
    |--------------------------------------------------------------------------
    |
    | 如果是local模式，会随机去目录中读取图片，目标是(0 ~ number).png.
    |
    */

    'imagePath' => [
        'local'  => [
            'dir'    => 'D:\code\DEMO\CAPTCHA_Idenify\new\imgs\\' ,
            'number' => 1000 ,
        ] ,
        'online' => [
            'url'             => 'http://61.142.33.204/CheckCode.aspx' ,
            'deleteImageFile' => true ,
        ]
    ] ,

    /*
    |--------------------------------------------------------------------------
    | cache verifyCode image dir
    |--------------------------------------------------------------------------
    |
    | 缓存验证码图片的目录
    |
    */

    'cacheVerifyCodeImageDir' => 'D:\code\DEMO\CAPTCHA_Idenify\new\imgs2\\' ,

    /*
    |--------------------------------------------------------------------------
    | number of CAPTCHA char
    |--------------------------------------------------------------------------
    |
    | 验证码的数量
    |
    */

    'captchaStringNum' => 4 ,


];

