<?php
/**
 * Created by PhpStorm.
 * User: kurisu
 * Date: 2017/11/04
 * Time: 3:36
 */


return [

    /*
    |--------------------------------------------------------------------------
    | 各个服务的提供者
    |--------------------------------------------------------------------------
    |
    |
    */
    'provider'        => [
        "PretreatmentProvider" => 'Pretreatment' ,
        "CuttingProvider"      => 'Cutting' ,
        "IdentifyProvider"     => 'Identify' ,
    ] ,

    /*
    |--------------------------------------------------------------------------
    | 获取验证码的模式
    |--------------------------------------------------------------------------
    |
    | local , online
    */
    'VerifyImageMode' => 'online' ,

    /*
    |--------------------------------------------------------------------------
    | 获取验证码的目录和url
    |--------------------------------------------------------------------------
    |
    | 如果是local模式，会随机去目录中读取图片，目标是(0 ~ number).png.
    |
    */
    'ImagePath'       => [
        'local'  => [
            'dir'    => 'D:\code\DEMO\CAPTCHA_Idenify\new\imgs\\' ,
            'number' => 1000 ,
        ] ,
        'online' => [
            'url'             => 'http://61.142.33.204/CheckCode.aspx' ,
            'savePath'        => 'D:\code\DEMO\CAPTCHA_Idenify\new\imgs2\\' ,
            'deleteImageFile' => true ,
        ]
    ] ,

    /*
    |--------------------------------------------------------------------------
    | 字典的目录和使用的字典
    |--------------------------------------------------------------------------
    |
    */

    'dictionary'       => 'dictionary/zhengFang_fixedCut.json' ,
//    'dictionary' => '/dictionary/model2.json' ,


    /*
    |--------------------------------------------------------------------------
    | 验证码的字数
    |--------------------------------------------------------------------------
    |
    */
    'captchaStringNum' => 4 ,

    /*
    |--------------------------------------------------------------------------
    | testSamplesDir
    |--------------------------------------------------------------------------
    | 测试样本放置的dir
    */

    'testSamples' => [
        'dir'    => 'D:\code\DEMO\CAPTCHA_Idenify\new\imgs_test\\' ,
        'number' => 200
    ]
];

